Конфигурация/DataProcessors/КопированиеНастроекСчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>КопированиеНастроекСчетаДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправленияКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправленияОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВзятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/DataProcessors/КопированиеНастроекСчетаДоверительногоУправления/Forms/ФормаБух/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьНастройкиПоУмолчанию();
	ЭтаФорма.ПодтверждениеПереноса = Ложь;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Параметры.Свойство("ДатаУстановки") Тогда
		Объект.ДатаУстановки = Параметры.ДатаУстановки; 
		Объект.ДатаВзятия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Параметры.Свойство("СчетДоверительногоУправленияКуда") Тогда
		Объект.СчетДоверительногоУправленияКуда = Параметры.СчетДоверительногоУправленияКуда;  
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаВзятия") Тогда
		Объект.ДатаВзятия = Параметры.ДатаВзятия; 
	КонецЕсли;
	
	Если Параметры.Свойство("СчетДоверительногоУправленияОткуда") Тогда
		Объект.СчетДоверительногоУправленияОткуда = Параметры.СчетДоверительногоУправленияОткуда;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСчетаИлиДаты(Элемент)
	
	СписокВзаимозаменяемыхДоговоров = Новый Массив;
	СписокВзаимозаменяемыхДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями"));
	СписокВзаимозаменяемыхДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами"));
	СписокВзаимозаменяемыхДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов"));
	
	ЗаполнятьСчетОткуда = Ложь;
	Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияКуда)  
		И ЗначениеЗаполнено(Объект.ДатаУстановки)
		И НЕ ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияОткуда) Тогда 
		ЗаполнятьСчетОткуда = Истина;  
	ИначеЕсли  ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияКуда)
		И ЗначениеЗаполнено(Объект.ДатаУстановки)
		И ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияОткуда) Тогда 
		ВидДоговораКуда = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправленияКуда, "ВидДоговораДоверительногоУправления");
		ВидДоговораОткуда = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправленияОткуда, "ВидДоговораДоверительногоУправления");
		
		Если ВидДоговораКуда <> ВидДоговораОткуда
			И НЕ (СписокВзаимозаменяемыхДоговоров.Найти(ВидДоговораКуда) <> Неопределено 
					И СписокВзаимозаменяемыхДоговоров.Найти(ВидДоговораОткуда) <> Неопределено) Тогда
			ЗаполнятьСчетОткуда = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнятьСчетОткуда Тогда
		Ответ = Вопрос("Подобрать счет ДУ с которого будут копироваться настройки?", РежимДиалогаВопрос.ДаНет);   
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СчетДоверительногоУправленияОткуда = КомандаПодобратьСчетДУОткудаАвтоматическиНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьНастройкиПоУмолчанию(); 
	ОбновлениеОтчетОПереносимыхНастройках();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПоУмолчанию()
	
	Если ЗначениеЗаполнено(Объект.ДатаВзятия) 
		И ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияОткуда) Тогда
		СписокПараметров = ПолучитьСписокПараметровНаСервере();
	Иначе
		СписокПараметров = Неопределено;
	КонецЕсли;
	
	ПроставитьНастройкиПереносаИДоступностьНастроек(СписокПараметров);
КонецПроцедуры 

&НаКлиенте
Функция ПроверитьПараметрыПереноса(ТекстОшибки, СообщатьОбОщибке = Истина)

	СписокЗаполнения = "";
    ПереносВозможен = Истина;
	Если НЕ ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияОткуда) Тогда 
		ПереносВозможен = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Счет доверительного управление откуда, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияКуда) Тогда 
		ПереносВозможен = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Счет доверительного управление куда, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаВзятия) Тогда 
		ПереносВозможен = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Дата взятия настроек, ";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаУстановки) Тогда 
		ПереносВозможен = Ложь;
		СписокЗаполнения = СписокЗаполнения + " Дата установки настроек, ";
	КонецЕсли;
	
	Если Не ПереносВозможен Тогда
		ТекстОшибки  = "Проверьте заполнение реквизитов переноса: " + Лев(СписокЗаполнения, СтрДлина(СписокЗаполнения) - 2); 
		Если СообщатьОбОщибке Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки); 
		КонецЕсли;
	КонецЕсли;
		
	Возврат ПереносВозможен;
	
КонецФункции

&НаСервере
Процедура ОтправитьОповещениеНаСервере(НастройкиПереноса, ТекстОшибки) 
	
	РеквизитФормыВЗначение("Объект").ОтправитьОповещение(ЭтаФорма.Отчет, НастройкиПереноса, Ложь, ТекстОшибки);
		
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура ПодтвердитьПереносИЗакрыть(Команда) 
	
	Отказ = Ложь;
	ТекстОшибки = "";
	
	ЭтаФорма.ПодтверждениеПереноса = Истина; 
	
	ПереносВозможен = ПроверитьПараметрыПереноса(ТекстОшибки);
	
	Если ПереносВозможен Тогда 
		НастройкиПереноса = ПолучитьСписокНастроекПереносаБух();
		СкопироватьНастройкиБУХ(НастройкиПереноса, ТекстОшибки, Отказ, ПолучитьСписокНастроекДляСтатистики());
		Если Не Отказ Тогда
			ОтправитьОповещениеНаСервере(НастройкиПереноса, ТекстОшибки);
			ЭтаФорма.Закрыть(); 
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выполнить копирование настроек не удалось!");
		КонецЕсли;  
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция КомандаПодобратьСчетДУОткудаАвтоматическиНаСервере()
	
	Возврат Обработки.КопированиеНастроекСчетаДоверительногоУправления.ПолучитьСчетОткудаДляКопированияНастроек(Объект.ДатаУстановки, Объект.Организация, Объект.СчетДоверительногоУправленияКуда);
	
КонецФункции
	
&НаКлиенте
Процедура КомандаПодобратьСчетДУОткудаАвтоматически(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.СчетДоверительногоУправленияКуда) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан Счет ДУ на который будут переноситься настройки");
		Возврат;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.ДатаУстановки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата установки настроек");
		Возврат;
	КонецЕсли;	
	
	Объект.СчетДоверительногоУправленияОткуда = КомандаПодобратьСчетДУОткудаАвтоматическиНаСервере(); 
	ПриИзмененииСчетаИлиДаты(Элементы.СчетДоверительногоУправленияОткуда);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)

	ТекстОшибки = "";
	Отказ = Ложь;
	ЭтаФорма.ПодтверждениеПереноса = Ложь;  
	
	Если ПроверитьПараметрыПереноса(ТекстОшибки) Тогда
		СкопироватьНастройкиБУХ(ПолучитьСписокНастроекПереносаБух(), ТекстОшибки, Отказ); 
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;

	ЭтаФорма.ТекущийЭлемент = Элементы.Отчет;
	
КонецПроцедуры  

#КонецОбласти

#Область ПереносБухгалтерия

&НаСервере
Функция ПолучитьСписокПараметровНаСервере()  

	СписокПараметров = РеквизитФормыВЗначение("Объект").ПолучитьПараметрыПереносаНастроекБухПоУмолчанию();
	Возврат СписокПараметров;
	
КонецФункции	

&НаСервере
Процедура СкопироватьНастройкиБУХ(НастройкиПереноса, ТекстОшибки, Отказ, НастройкиДляСтатистики = Неопределено)

	Если ЭтаФорма.ПодтверждениеПереноса Тогда
		Сессия = Неопределено;
		ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(НастройкиДляСтатистики);
		Механизм = Метаданные.Обработки.КопированиеНастроекСчетаДоверительногоУправления.ПолноеИмя();
		Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	КонецЕсли;
	
	РеквизитФормыВЗначение("Объект").ПереносНастроекБух(ЭтаФорма.Отчет, НастройкиПереноса, Отказ, Ложь, ТекстОшибки);
	
	Если ЭтаФорма.ПодтверждениеПереноса Тогда
		Если Сессия <> Неопределено Тогда
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Функция ПолучитьСписокНастроекПереносаБух()
	
	НастройкиПереноса = Новый Структура;
	НастройкиПереноса.Вставить("Общие", ЭтаФорма.Общие);
	НастройкиПереноса.Вставить("ПоВидуБУ", ЭтаФорма.ПоВидуБУ);
	НастройкиПереноса.Вставить("ПоВидуЕПС", ЭтаФорма.ПоВидуЕПС);
	НастройкиПереноса.Вставить("ПоВидуНУ", ЭтаФорма.ПоВидуНУ);
	НастройкиПереноса.Вставить("Активы", ЭтаФорма.Активы);
	НастройкиПереноса.Вставить("АктивыПоСрочности", ЭтаФорма.АктивыПоСрочности);
	НастройкиПереноса.Вставить("ПереопределениеКлассификации", ЭтаФорма.ПереопределениеКлассификации);
	НастройкиПереноса.Вставить("ЗакрытияСчетов", ЭтаФорма.ЗакрытияСчетов);
	НастройкиПереноса.Вставить("Комиссия", ЭтаФорма.Комиссия);
	НастройкиПереноса.Вставить("ПодтверждениеПереноса", ЭтаФорма.ПодтверждениеПереноса);
	НастройкиПереноса.Вставить("КлиентКуда", ЭтаФорма.КлиентКуда);
	НастройкиПереноса.Вставить("КлиентОткуда", ЭтаФорма.КлиентОткуда);	

	Возврат НастройкиПереноса;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокНастроекДляСтатистики()

	НастройкиСтатистки = Новый Структура;     
	
	НастройкиСтатистки.Вставить("Организация", Объект.Организация);
	НастройкиСтатистки.Вставить("СчетДоверительногоУправленияКуда", Объект.СчетДоверительногоУправленияКуда);
	НастройкиСтатистки.Вставить("СчетДоверительногоУправленияОткуда", Объект.СчетДоверительногоУправленияОткуда);
	НастройкиСтатистки.Вставить("ДатаВзятия", Объект.ДатаВзятия);
	НастройкиСтатистки.Вставить("ДатаУстановки", Объект.ДатаУстановки);
	
	НастройкиСтатистки.Вставить("Общие", ЭтаФорма.Общие);
	НастройкиСтатистки.Вставить("ПоВидуБУ", ЭтаФорма.ПоВидуБУ);
	НастройкиСтатистки.Вставить("ПоВидуЕПС", ЭтаФорма.ПоВидуЕПС);
	НастройкиСтатистки.Вставить("ПоВидуНУ", ЭтаФорма.ПоВидуНУ);
	НастройкиСтатистки.Вставить("Активы", ЭтаФорма.Активы);
	НастройкиСтатистки.Вставить("АктивыПоСрочности", ЭтаФорма.АктивыПоСрочности);
	НастройкиСтатистки.Вставить("ПереопределениеКлассификации", ЭтаФорма.ПереопределениеКлассификации);
	НастройкиСтатистки.Вставить("ЗакрытияСчетов", ЭтаФорма.ЗакрытияСчетов);
	НастройкиСтатистки.Вставить("Комиссия", ЭтаФорма.Комиссия);
	
	
	Возврат НастройкиСтатистки;
		
КонецФункции


&НаКлиенте
Процедура ПроставитьНастройкиПереносаИДоступностьНастроек(СписокПараметров)  
	
	Если СписокПараметров = Неопределено Тогда 
		ВестиБухгалтерскийУчет = Ложь;
		ВестиЕдиныйБухгалтерскийУчет = Ложь;
		ВестиНалоговыйУчет = Ложь;
		ЭтоОдинКлиент = Ложь;
	Иначе 
		ВестиБухгалтерскийУчет = СписокПараметров.ВестиБухгалтерскийУчет;
		ВестиЕдиныйБухгалтерскийУчет = СписокПараметров.ВестиЕдиныйБухгалтерскийУчет;
		ВестиНалоговыйУчет = СписокПараметров.ВестиНалоговыйУчет;		
		ЭтоОдинКлиент = (СписокПараметров.КлиентОткуда = СписокПараметров.КлиентКуда);  
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СписокПараметров);
	Конецесли;	
	
	ЭтаФорма.Элементы.ПоВидуЕПС.Доступность = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.Элементы.ПоВидуБУ.Доступность = ВестиБухгалтерскийУчет;
	ЭтаФорма.Элементы.ПоВидуНУ.Доступность = ВестиНалоговыйУчет;   
		
	ЭтаФорма.Элементы.Активы.Доступность = ВестиЕдиныйБухгалтерскийУчет ИЛИ ВестиБухгалтерскийУчет ИЛИ ВестиНалоговыйУчет;
	ЭтаФорма.Элементы.Комиссия.Доступность = ВестиЕдиныйБухгалтерскийУчет ИЛИ ВестиБухгалтерскийУчет ИЛИ ВестиНалоговыйУчет;
	ЭтаФорма.Элементы.ЗакрытияСчетов.Доступность = ВестиЕдиныйБухгалтерскийУчет ИЛИ ВестиБухгалтерскийУчет ИЛИ ВестиНалоговыйУчет;	
	ЭтаФорма.Элементы.АктивыПоСрочности.Доступность = ВестиЕдиныйБухгалтерскийУчет;
	
	Если ВестиЕдиныйБухгалтерскийУчет И Не ЭтоОдинКлиент Тогда 
		ЭтаФорма.Элементы.ПереопределениеКлассификации.Доступность = Истина; 
	Иначе
		ЭтаФорма.Элементы.ПереопределениеКлассификации.Доступность = Ложь; 
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ОбновлениеОтчетОПереносимыхНастройках()
	
	ТекстОшибки = "";
	Если ПроверитьПараметрыПереноса(ТекстОшибки, Ложь) Тогда
		СкопироватьНастройкиБУХ(ПолучитьСписокНастроекПереносаБух(), ТекстОшибки, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпцияНастройкиПриИзменении(Элемент)
	ОбновлениеОтчетОПереносимыхНастройках();
КонецПроцедуры
